import React from 'react';

const Frontpage = () => (
  <div>
    <h1>Методика определения типа личности Олдхэма-Морриса</h1>
    <p>
      Тест содержит 107 вопросов, на которые нужно ответить, хорошенько обдумывая каждый.
      Постарайтесь сделать это максимально точно и честно. Ваш автопортрет будет настолько же
      точным, насколько точными будут ответы. Даже если вы считаете, что вопрос не касается вас или
      вашей личной жизни, отвечайте так, как если бы он имел к вам отношение.
    </p>
    <p>
      Некоторые вопросы могут показаться слишком личными, – помните, что ответы на каждый отдельный
      вопрос нигде не сохраняются, и никто (даже вы сами) не сможет их увидеть по окончании теста.
    </p>
    <p>
      Отвечайте «Да, я согласен», если утверждение совершенно верно для вас в большинстве случаев
      Отвечайте «Может быть, я согласен», если утверждение иногда, в каких-то случаях верно для вас.
      Также используйте этот ответ для утверждений, состоящих из нескольких частей, если вы согласны
      с одной частью, но не согласны с другой. Отвечайте «Нет, я не согласен», если утверждение
      совершенно ложно для вас.
    </p>
    <a href="/oldham-morris">Начать тестирование</a>
  </div>
);

export default Frontpage;
